exampleCase/Evap_k4_split_phi1.8+2.5/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.23197;

boundaryField
{
    AXIS
    {
        type            empty;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0.23197;
    }
    COFLOW
    {
        type            calculated;
        value           uniform 0.23197;
    }
    PILOT
    {
        type            calculated;
        value           uniform 0.23197;
    }
    FUEL
    {
        type            calculated;
        value           uniform 0.23197;
    }
    WALL
    {
        type            calculated;
        value           uniform 0.23197;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
