exampleCase/Evap_k4_split_phi1.8+2.5/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    AXIS
    {
        type            empty;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    COFLOW
    {
        type            calculated;
        value           uniform 0;
    }
    PILOT
    {
        type            calculated;
        value           uniform 0;
    }
    FUEL
    {
        type            calculated;
        value           uniform 0;
    }
    WALL
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
