exampleCase/Evap_k4_split_phi1.8+2.5/0/Z
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Z;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    AXIS
    {
        type            empty;
    }
    OUTLET
    {
	type 		zeroGradient;        
	/*type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;*/
    }
    COFLOW
    {
        type            fixedValue;
        value           uniform 0;
    }
    PILOT
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    FUEL
    {
        type            fixedValue;
        value           uniform 0.013;
    }
    WALL
    {
        type            zeroGradient;
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
