exampleCase/Evap_k4_split_phi1.8+2.5/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sprayFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.3;

deltaT          5.0e-06;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.4;

runTimeModifiable yes;

libs ("libuniformFixedProfile.so");

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            T
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            Z
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            Yc
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

	        sourceEvap
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
	
	        OH
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            varZ
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

        );
    }
}
// ************************************************************************* //
